import 'adhkar_data.dart';

const List<AdhkarCategory> adhkarMore = [
  AdhkarCategory('food', 'أذكار الطعام', [
    Dhikr(
      'بِسْمِ اللَّهِ',
      1,
    ),
    Dhikr(
      'بِسْمِ اللَّهِ أَوَّلَهُ وَآخِرَهُ',
      1,
    ),
    Dhikr(
      'الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ',
      1,
    ),
  ]),
  AdhkarCategory('travel', 'أذكار السفر', [
    Dhikr(
      'سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ',
      1,
    ),
    Dhikr(
      'اللَّهُ أَكْبَرُ',
      3,
    ),
    Dhikr(
      'أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ',
      3,
    ),
  ]),
  AdhkarCategory('sick', 'أذكار المرض', [
    Dhikr(
      'بِسْمِ اللَّهِ',
      3,
    ),
    Dhikr(
      'أَعُوذُ بِعِزَّةِ اللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ',
      7,
    ),
  ]),
  AdhkarCategory('hajj', 'أذكار الحج والعمرة', [
    Dhikr(
      'لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ، لَا شَرِيكَ لَكَ',
      10,
    ),
    Dhikr(
      'رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ',
      7,
    ),
  ]),
];
